{
  "main": {
    "name":"Ed Friesema",
    "occupation":"applications engineer",
    "description":"My mission is to use the tremendous power of modern computing to help you break through your obstacles and achieve your goals.",
    "image":"profilepic.jpg",
    "contactText":"If you have any questions about my projects, interests, or need my help with any applications you have in mind, please let me hear from you.",
    "bio":"I'm new to developing software applications but I've spent ten years helping clients find the right combination of software and hardware to deliver the best quality videos and games to their clients around the world. I'm dedicated to using ReactJS and ASP.NET to deliver solutions to clients whatever their business or audience. When I have the time I love to travel, play poker, hike and sing bad karaoke.",
    "email": "developer@streamverse.net",
    "phone": "818-355-2049",
    "address":{
      "street":"3113 Highland Falls Dr",
      "city":"Las Vegas",
      "state":"NV",
      "zip": "89134"
    },
    "website": "http://www.streamverse.net",
    "resumedownload":"http://localhost:3000/resume/EdF_app_eng2.doc",
    "social":[
      {
        "name":"twitter",
        "url":"http://twitter.com",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"http://www.linkedin.com/in/ed-friesema-97b05632/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/efriesema",
        "className":"fa fa-github"
      },
      {
        "name":"pinterest",
        "url":"http://pinterest.com",
        "className":"fa fa-pinterest"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"University of California - San Diego",
        "degree":"Masters in Electrical and Computer Engineering -Optics Specialization ",
        "graduated":"June 2003",
        "description":"Developed and tested an opto-electronic ultra-fast switch using a piezo-electric transducer. Led discussion sections, held office hours, and graded labs and exams for undergraduate engineering courses."
      },
      {
        "school":"Pennsylvania State University",
        "degree":"B.S. Degree in Electrical Engieneering",
        "graduated":"June 1997",
        "description":"Tau Beta Pi Engineering Honors fraternity.\nSpent a year studying engineering at Leeds University, England."
      }
    ],
    "work":[
      {
        "company":"Sutherland Global Services",
        "title":"Technical Support Representative",
        "years":"April 2017 -  September 2017",
        "description":"Provided Tier 1 technical support to customers of AT&T Digital Life, using VPN and remote access tools to troubleshoot wireless, networking, hardware, and phone app issues in a fast-paced call center."
      },
      {
        "company":"Streamverse",
        "title":"Lead Trainer and Application Engineer",
        "years":"January 2013 - March 2017",
        "description":"Trained and operated for clients ranging from houses of worship to network affiliates, teaching them how to engineer and operate live production technology like Newtek Tricaster, Wowza Streaming Engine, and Telestream to deliver high quality video streaming and gaming experiences."
      },
      {
        "company":"Key Code Media",
        "title":"Applications Engineer",
        "years":"September 2010 - December 2013",
        "description":"Trained and operated for clients ranging from houses of worship to network affiliates, teaching them how to engineer and operate live production technology like Newtek Tricaster, Wowza and , Crestron, Telestream to deliver high quality video streaming and gaming experiences."
      }
    ],
    "skills":[
      {
        "title":"C#",
        "name":"Csharp",
        "level":"30%"
      },
      {
        "title":"Javascript/ES6",
        "name":"Javascript",
        "level":"65%"
      },
      {
        "title":"Wordpress",
        "name":"Wordpress",
        "level":"40%"
      },
      {
        "title":"CSS",
        "name":"CSS",
        "level":"80%"
      },
      {
        "title":"HTML5",
        "name":"HTML5",
        "level":"80%"
      },
      {
        "title":"ReactJS",
        "name":"ReactJS",
        "level":"50%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Music Master",
        "description":"A ReactJS application utilizing Spotify's Web API to create a preview playlist of the top ten tracks for any artist. This was based on the lesson in David Katz's Udemy course, ReactJS and Redux- Mastering Web Apps.",
        "category":"Web Application",
        "tags":"ReactJS,  Development, Multimedia, APIs",
        "image":"black-headphones.jpg",
        "url":"http://http://github.com/efriesema/musicMaster",
        "modal":"#modal-01"
      },
      {
        "title":"Watson Speech Translator",
        "description":"An application using Watson's engine for English text-to-speech and speech-to-text translation.  Further development includes incorporating the technology into an application to help children learn how to read.",
        "category":"Machine Learning",
        "tags":"IBM Watson, Machine Learning, AI, Speech Recognition",
        "image":"human-brain-in-blue.jpg",
        "url":"http://console.ng.bluemix.net",
        "modal":"#modal-02"
      },
      {
        "title":"Shoot The Hoop VR",
        "description":"Proin gravida nibh vel velit auctor aliquet. Aenean sollicitudin, lorem quis bibendum auctor, nisi elit consequat ipsum, nec sagittis sem nibh id elit.",
        "category":"Virtual Reality",
        "tags":"Virtual Reality,  Unity, C#, Gaming",
        "image":"virtual-reality.jpg",
        "url":"http://www.github.com/efriesema",
        "modal":"#modal-03"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Ed really helped us integrate and test some complicated systems for our show.  He was very knowledgeable and always available to help us with our questions during the entire process.",
        "user":"Tom Baird, Chief Engineer, Dr. Phil Show"
      },
      {
        "text":"Ed helped give our people the skills they needed to achieve some very important goals that we'd been wanting for a long time.  His expertise and willingness to work with our staff solved some problems that had been blocking us for months.",
        "user":"Steve Harrington, VP Engineering & Operations KTTV and KCOP"
      },
            {
        "text":"Ed gave a us a full day seminar on using Avid Media Composer in a reality TV post production workflow.  His knowledge and enthusiasm really shined through. It made the transition a lot smoother for our entire team, which was critical because of our tight schedule.",
        "user":"William Pisnieski, VP of Post Production for Authentic Entertainment LLC"
      }
    ]
  }
}
